tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "batect/batect"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
tap "pivotal/tap"
brew "nvm"
brew "ansible"
brew "bash-completion"
brew "coreutils"
brew "bats-core"
brew "clojure"
brew "qemu"
brew "lima"
brew "colima"
brew "colordiff"
brew "darcs"
brew "deno"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dsq"
brew "dua-cli"
brew "entr"
brew "exercism"
brew "fd"
brew "fzf"
brew "gauge"
brew "git"
brew "git-quick-stats"
brew "git-sizer"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "hadolint"
brew "haskell-stack"
brew "httpie"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "leiningen"
brew "ruby"
brew "maven"
brew "mercurial"
brew "neovim"
brew "nmap"
brew "nushell"
brew "pre-commit"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vegeta"
brew "wget"
brew "xsv"
brew "yq"
brew "zoxide"
brew "zsh-completions"
brew "batect/batect/batect-zsh-completion"
cask "adoptopenjdk11"
cask "adoptopenjdk13"
cask "brave-browser"
cask "chromedriver"
cask "devtoys"
cask "google-chrome"
cask "racket"
cask "rectangle"
cask "vimr"
cask "visual-studio-code"

cask "google-cloud-sdk"

brew "gh"
brew "dotnet"
brew "python@3"
brew "virtualenv"

brew "rustup-init"


vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "borkdude.clj-kondo"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "exiasr.hadolint"
vscode "firsttris.vscode-jest-runner"
vscode "getgauge.gauge"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "Ionide.Ionide-fsharp"
vscode "jebbs.plantuml"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.avro"
vscode "systemticks.c4-dsl-extension"
vscode "tgriesser.avro-schemas"
vscode "timonwong.shellcheck"
vscode "vmsynkov.colonize"
vscode "vscodevim.vim"


# Stuff for TW platform course
cask "1password/tap/1password-cli"
cask "chef/chef/inspec"
brew "circleci"
brew "awscli@2"
brew "cosign"


# OTR stuff
brew "pre-commit"
brew "borkdude/brew/clj-kondo"
brew "hadolint"
brew "talisman"
brew "shellcheck"
