tap "azure/kubelogin"
tap "batect/batect"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
tap "pivotal/tap"
brew "nvm"
brew "ansible"
brew "bash-completion"
brew "coreutils"
brew "bats-core"
brew "clojure"
brew "qemu"
brew "lima"
brew "colima"
brew "colordiff"
brew "darcs"
brew "deno"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dsq"
brew "dua-cli"
brew "entr"
brew "exercism"
brew "fd"
brew "fzf"
brew "gauge"
brew "gawk"
brew "git"
brew "git-quick-stats"
brew "git-sizer"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "hadolint"
brew "haskell-stack"
brew "difftastic"

cask "ghostty"

brew "graphviz"

brew "poetry"
brew "rust"

brew "httpie"
# required for httpie, but apparently sometimes not installed:
# https://stackoverflow.com/a/77360089
brew "python-certifi"
brew "pygments"

brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "krew"
brew "leiningen"
brew "ruby"
brew "maven"
brew "mercurial"
brew "neovim"
brew "nmap"
brew "nushell"
brew "pre-commit"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "telnet"
# brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vegeta"
brew "wget"
brew "xsv"
brew "yq"
brew "zoxide"
brew "zsh-completions"
brew "batect/batect/batect-zsh-completion"
cask "brave-browser"
cask "chromedriver"
cask "devtoys"
cask "google-chrome"
cask "racket"
cask "rectangle"
cask "vimr"
cask "visual-studio-code"

cask "logseq"
cask "hex-fiend"

cask "google-cloud-sdk"

brew "gh"
brew "dotnet"
brew "python@3"
brew "pipx"
brew "virtualenv"
brew "watch"

brew "rustup-init"

brew "borkdude/brew/babashka"

brew "git-secrets"

brew "kakoune"
brew "cue"

# don't really need the server locally, but promtool is handy
brew "prometheus"

# Currently not working together, as ifstat might not be on PATH for xbar...
cask "xbar"
brew "ifstat"

cask "itsycal"

brew "lua"
# brew "luarocks"
brew "busted"

# added for messing with rails and psql
brew "libpq"
brew "yarn"

# added for BB's uncluttered course
brew "esbuild"

brew "minisign"

brew "trufflehog"
brew "gitleaks"
brew "talisman"

brew "dialog"

brew "git-filter-repo"

tap "kanriapp/cask"
cask "kanri"

vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "borkdude.clj-kondo"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "exiasr.hadolint"
vscode "firsttris.vscode-jest-runner"
vscode "getgauge.gauge"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "Ionide.Ionide-fsharp"
vscode "jebbs.plantuml"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.avro"
vscode "systemticks.c4-dsl-extension"
vscode "tgriesser.avro-schemas"
vscode "timonwong.shellcheck"
vscode "vmsynkov.colonize"
vscode "vscodevim.vim"


# Stuff for TW platform course and general k8s stuff
cask "1password/tap/1password-cli"
cask "chef/chef/inspec"
brew "circleci"
brew "awscli@2"
brew "cosign"
brew "minikube"
brew "istioctl"
brew "kind"
brew "helm"
brew "consul-k8s"
brew "consul"


# OTR stuff
brew "pre-commit"
brew "borkdude/brew/clj-kondo"
brew "hadolint"
brew "talisman"
brew "shellcheck"
brew "act"
brew "skopeo"
brew "trivy"
brew "nginx"
brew "direnv"
brew "socat"
# for compatibility with gha runners:
brew "python@3.9"

# shell fun
brew "nushell"
brew "fish"


brew "hashicorp/tap/terraform"

brew "tflint"

# stuff for https://operating-system-in-1000-lines.vercel.app/en/01-setting-up-development-environment
brew "llvm"
brew "lld"
brew "qemu"

cask "librewolf", args: { no_quarantine: true }

# for converting csv->xslx in scripts
brew "gnumeric"

cask "db-browser-for-sqlite"

brew "hashicorp/tap/vault"

