tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "batect/batect"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
tap "pivotal/tap"
brew "allure"
brew "ansible"
brew "bash-completion"
brew "coreutils"
brew "bats-core"
brew "clojure"
brew "qemu"
brew "lima"
brew "colima"
brew "colordiff"
brew "darcs"
brew "deno"
brew "dive"
brew "docker"
brew "docker-compose"
brew "dsq"
brew "dua-cli"
brew "entr"
brew "exercism"
brew "fd"
brew "fzf"
brew "gauge"
brew "git"
brew "git-quick-stats"
brew "git-sizer"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "hadolint"
brew "haskell-stack"
brew "httpie"
brew "jq"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "leiningen"
brew "ruby"
brew "maven"
brew "mercurial"
brew "neovim"
brew "nmap"
brew "nushell"
brew "pre-commit"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vegeta"
brew "wget"
brew "xsv"
brew "yq"
brew "zoxide"
brew "zsh-completions"
brew "batect/batect/batect-zsh-completion"
cask "adoptopenjdk11"
cask "adoptopenjdk13"
cask "brave-browser"
cask "chromedriver"
cask "devtoys"
cask "google-chrome"
cask "racket"
cask "rectangle"
cask "vimr"
cask "visual-studio-code"
